---
kind: property
id: P:Autodesk.Revit.DB.FloorType.IsFoundationSlab
source: html/8db52ddf-b529-d3bd-b787-4ffb059251cf.htm
---
# Autodesk.Revit.DB.FloorType.IsFoundationSlab Property

Returns whether the element FloorAttributes type is FoundationSlab.

## Syntax (C#)
```csharp
public bool IsFoundationSlab { get; }
```